robot_business_models.org
#+TITLE:Robotics business models

This essay gives a quick survey of common business models in robotics, then wildly speculates about future business models.  

* Robot hardware
** Robots as equiptment
Classically, robot manufacturers built hardware then sold it.

While the first programmable industrial robot was installed and programmed by the inventor's (Devol and Engelberger) company, at some point after this, robot production and integration were split out to different business entities. Today, the typical business relationship is that integrators -- typically, smaller companies with geographically local customers -- make a contract with an end-user then design, install, program, and validate the robot cell. The integrator can then offer long-term support, updates, or maintnence on this cell, key to reach the reliability expected in industry. Integrators will typically work with just one (or a handful) of robot manufacturers, building know-how and often some tooling, e.g. to help program the robots.

Some robot manufacturers today (e.g. KUKA) have advanced integrators in-house, albeit as separate business units. This allows the company to reach higher-touch customers who have applications which require e.g. customization or a new interface. Putting advanced integrators and robot developers in one organization supports any needed robot development (e.g. new control interfaces).

This business model is built for classical factories: the integrator provides a reliable solution for the specific problem, and a backstop for possible problems via support. However, when the product changes, the integrator needs to be called out and the process carried out again.

** Robots as a platform
As robots got safer and easier to program, a push for 'democratization' began. This goal is to allow end-users (e.g. engineers or operators on the factory floor) to program the robot directly, saving the time/cost of hiring an integrator while providing a path to upskilling operators. Robotics manufacturers positioned for this (Universal Robots, Franka Emika, Agile Robots) focus on polished, easy-to-use interfaces and safer robot hardware.

Typically these robots can be used in applications which have less stringent requirements on accuracy, speed, and reliability. This change in requirements is required from the hardware -- robots which are safer are typically slower, less accurate, and sometimes less reliable. Additionally, typically only simpler tasks with point-to-point motion can be easily programmed in this way, complex parameterized or sensor-based motions may be more difficult.

How is a platform different from robots-as-hardware?
- Interface: The manufacturer may provide an easy programming interface, e.g. moving the robot by hand to teach positions, a drag-n-drop programming interface to build logic, etc. 
- Hardware:  When additional hardware is required (linear axis, new gripper), the manufacturer may allow 3rd parties to offer integrated software modules which ease deployment. For example UR Caps install a program stub on the controller which runs in the background and exposes a higher-level API to the programming environment.
- Software:  An app store could also be provided by the manufacturer, where functionalities or programs can be offered - e.g. a parameterized program for screwing or other complex operations.  Such programs could theoretically encapsulate common behaviors, and expose higher-level parameters so they can be easily instantiated by end-users, reducing the need for detailed robotics knowledge.

This model typically aims at distributors, not integrators, as points of sale. The distributors can offer trainings to end-users on programming and maitenance. However, today, many of these robots are still sold via integrators. Theoretically this model can achieve higher flexibility - the programmers would be there on the factory floor. However, the degree of product change which happens today is strongly limited by general complexity in the assembly line, meaning this flexibility is not often used.

** Robots as internal tools
Robots can also be developed and deployed only as internal tools - the company provides some service (e.g. mowing lawns), and fulfills this service with either manual work or robots. A major benefit of this is supporting bootstrapping; a robotics company like Electric Sheep can acquire existing lawncare companies, then improve their efficiency over time with robotics.  This is helpful if you need time to collect data for your robotics solution, and would support a fast iteration cycle which is closed around real customers.

* Currently, no true application-level product or marketplace 
Today, almost no end-users can go their friendly neighborhood robot store and directly buy a single product that solves their problem. A 'robotic solution' is a set of products, integrated with either on-site or purchased expertise, with application-specific parameterization and programming. 

Is this bad? Sometimes. Automation has high barriers to entry, preventing companies with less capital or in-house expertise from getting the efficiency gains.  However, if the technical barriers (difficulty in integration, programming) were magically removed, the customer will still need good expectations about how to fit the robot into their production environment - a kind of expertise which seems necessary regardless how 'good' the robots are. 

So, there's no real robotics product. But it gets worse: robotics does not even have an application-level marketplace where competitive bids/offers clear in arms-length transactions. You could imagine a website where a customer uploads a description of their problem, and companies put in offers for a solution. But there's a few reasons we don't see this:
- Formulating the requirements typically requires on-site expertise
- Formulating a solution which meets requirements takes too much time, typically needs interaction with the potential customer
- Geographically limited due to need for on-site delivery & integration
So, even getting an offer for a robotic solution typically means a subject-matter expert has to come by, look at your problem, and make a quote based on this. 
  
* [complete speculation] What if you could just buy a robot that solves your problem? 
Many people are trying to develop robots with general skills - where you can have a true robotic product which can be deployed for a range of applications.  A kitchen robot, which could put away dishes in any kitchen.  A packing robot, which could pick any items in a warehouse and place them in boxes.

This would indeed be a disruptive jump, allowing true robot products which are low-touch: no need for integrators _or_ trained local staff. As a concrete example,  many starutps today are developing general warehouse robots: doing picking, sorting, and even packing of 'arbitrary' products. 

