robot_business_models.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-01 Wed 05:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Robotics business models</title>
<meta name="author" content="IPK559L" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="css/style.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Robotics business models</h1>
<p>
This essay gives a quick survey of common business models in robotics, then wildly speculates about future business models.  
</p>

<div id="outline-container-orgc9bcb9e" class="outline-2">
<h2 id="orgc9bcb9e"><span class="section-number-2">1.</span> Robot hardware</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org69409a1" class="outline-3">
<h3 id="org69409a1"><span class="section-number-3">1.1.</span> Robots as equiptment</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Classically, robot manufacturers built hardware then sold it.
</p>

<p>
While the first programmable industrial robot was installed and programmed by the inventor's (Devol and Engelberger) company, at some point after this, robot production and integration were split out to different business entities. Today, the typical business relationship is that integrators &#x2013; typically, smaller companies with geographically local customers &#x2013; make a contract with an end-user then design, install, program, and validate the robot cell. The integrator can then offer long-term support, updates, or maintnence on this cell, key to reach the reliability expected in industry. Integrators will typically work with just one (or a handful) of robot manufacturers, building know-how and often some tooling, e.g. to help program the robots.
</p>

<p>
Some robot manufacturers today (e.g. KUKA) have advanced integrators in-house, albeit as separate business units. This allows the company to reach higher-touch customers who have applications which require e.g. customization or a new interface. Putting advanced integrators and robot developers in one organization supports any needed robot development (e.g. new control interfaces).
</p>

<p>
This business model is built for classical factories: the integrator provides a reliable solution for the specific problem, and a backstop for possible problems via support. However, when the product changes, the integrator needs to be called out and the process carried out again.
</p>
</div>
</div>

<div id="outline-container-orgf0205fc" class="outline-3">
<h3 id="orgf0205fc"><span class="section-number-3">1.2.</span> Robots as a platform</h3>
<div class="outline-text-3" id="text-1-2">
<p>
As robots got safer and easier to program, a push for 'democratization' began. This goal is to allow end-users (e.g. engineers or operators on the factory floor) to program the robot directly, saving the time/cost of hiring an integrator while providing a path to upskilling operators. Robotics manufacturers positioned for this (Universal Robots, Franka Emika, Agile Robots) focus on polished, easy-to-use interfaces and safer robot hardware.
</p>

<p>
Typically these robots can be used in applications which have less stringent requirements on accuracy, speed, and reliability. This change in requirements is required from the hardware &#x2013; robots which are safer are typically slower, less accurate, and sometimes less reliable. Additionally, typically only simpler tasks with point-to-point motion can be easily programmed in this way, complex parameterized or sensor-based motions may be more difficult.
</p>

<p>
How is a platform different from robots-as-hardware?
</p>
<ul class="org-ul">
<li>Interface: The manufacturer may provide an easy programming interface, e.g. moving the robot by hand to teach positions, a drag-n-drop programming interface to build logic, etc.</li>
<li>Hardware:  When additional hardware is required (linear axis, new gripper), the manufacturer may allow 3rd parties to offer integrated software modules which ease deployment. For example UR Caps install a program stub on the controller which runs in the background and exposes a higher-level API to the programming environment.</li>
<li>Software:  An app store could also be provided by the manufacturer, where functionalities or programs can be offered - e.g. a parameterized program for screwing or other complex operations.  Such programs could theoretically encapsulate common behaviors, and expose higher-level parameters so they can be easily instantiated by end-users, reducing the need for detailed robotics knowledge.</li>
</ul>

<p>
This model typically aims at distributors, not integrators, as points of sale. The distributors can offer trainings to end-users on programming and maitenance. However, today, many of these robots are still sold via integrators. Theoretically this model can achieve higher flexibility - the programmers would be there on the factory floor. However, the degree of product change which happens today is strongly limited by general complexity in the assembly line, meaning this flexibility is not often used.
</p>
</div>
</div>

<div id="outline-container-org86cf751" class="outline-3">
<h3 id="org86cf751"><span class="section-number-3">1.3.</span> Robots as internal tools</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Robots can also be developed and deployed only as internal tools - the company provides some service (e.g. mowing lawns), and fulfills this service with either manual work or robots. A major benefit of this is supporting bootstrapping; a robotics company like Electric Sheep can acquire existing lawncare companies, then improve their efficiency over time with robotics.  This is helpful if you need time to collect data for your robotics solution, and would support a fast iteration cycle which is closed around real customers.
</p>
</div>
</div>
</div>

<div id="outline-container-org808ad27" class="outline-2">
<h2 id="org808ad27"><span class="section-number-2">2.</span> Currently, no true application-level product or marketplace</h2>
<div class="outline-text-2" id="text-2">
<p>
Today, almost no end-users can go their friendly neighborhood robot store and directly buy a single product that solves their problem. A 'robotic solution' is a set of products, integrated with either on-site or purchased expertise, with application-specific parameterization and programming. 
</p>

<p>
Is this bad? Sometimes. Automation has high barriers to entry, preventing companies with less capital or in-house expertise from getting the efficiency gains.  However, if the technical barriers (difficulty in integration, programming) were magically removed, the customer will still need good expectations about how to fit the robot into their production environment - a kind of expertise which seems necessary regardless how 'good' the robots are. 
</p>

<p>
So, there's no real robotics product. But it gets worse: robotics does not even have an application-level marketplace where competitive bids/offers clear in arms-length transactions. You could imagine a website where a customer uploads a description of their problem, and companies put in offers for a solution. But there's a few reasons we don't see this:
</p>
<ul class="org-ul">
<li>Formulating the requirements typically requires on-site expertise</li>
<li>Formulating a solution which meets requirements takes too much time, typically needs interaction with the potential customer</li>
<li>Geographically limited due to need for on-site delivery &amp; integration</li>
</ul>
<p>
So, even getting an offer for a robotic solution typically means a subject-matter expert has to come by, look at your problem, and make a quote based on this. 
</p>
</div>
</div>

<div id="outline-container-orgbeada04" class="outline-2">
<h2 id="orgbeada04"><span class="section-number-2">3.</span> [complete speculation] What if you could just buy a robot that solves your problem?</h2>
<div class="outline-text-2" id="text-3">
<p>
Many people are trying to develop robots with general skills - where you can have a true robotic product which can be deployed for a range of applications.  A kitchen robot, which could put away dishes in any kitchen.  A packing robot, which could pick any items in a warehouse and place them in boxes.
</p>

<p>
This would indeed be a disruptive jump, allowing true robot products which are low-touch: no need for integrators <span class="underline">or</span> trained local staff. As a concrete example,  many starutps today are developing general warehouse robots: doing picking, sorting, and even packing of 'arbitrary' products. 
</p>
</div>
