robot_business_models.org
** What would be needed?
- Applications which either do not have a lot of edge cases, or where those edge cases are not critical. Covering 90% of cases is easy, with increasing difficulty to increase coverage.  While thinkable that these robots could improve over time with experience, that requires broad deployment, and getting broad deployment means you need a use-case where a lower success rate is acceptable. For example, putting dishes away might be OK with 90% success, some customers might still be happy to do 10% by hand, appreciating that the bulk of the work is done.  However, convincing factory engineers to deploy a 90% successful robot in a line is another story.
- Customers willing to take the risk of having less support.  If this is an arms-length sale, a warranty could be included, but the entire goal is to reduce the need for individual support. 
- Robot hardware which:
  - is sufficiently abstracted, such that feasibility issues (joint limits, singularity, gripper malfunction, etc) are rare.
  - is networked, at least to pull updates, probably also to push local data.
- It probably needs vision. It is difficult to imagine handling task variation by a lower-dimensional sensor. 
** What could it enable?
- Flywheel effects: the product improves from the range of data it has collected, market leaders would be able to offer better products.
- Service or rental models: if deployment is so easy, it would be possible to rent the robot behavior for shorter periods of time (e.g. peak season). Whether this is compatible with a way of allocating hardware remains to be seen. This would have a variety of knock-on effects: 
  - Automation penetration by smaller customers: today, smaller customers are typically priced out by the up-front capital required to get a solution. If they can click and deploy, up-front costs are reduced.
  - Flexible production, where robots are re-allocated much more easily.  This would require a range of robot skills to be products though.
- Robots in homes would be technically feasible, but I just don't see the economics of this working out for anyone outside the richest 1%, who would probably prefer the reliability / comfort / non-disruption of traditional 'staff'.  
** What other players could there be in the ecosystem?
This would be a fundamentally different ecosystem, with different players. What are some possible new players in the ecosystem?
*** Skill providers in partnership with robot manufacturers
As more of the value-add comes from the software, it's likely that these players will try to position themselves in a more central way. They might do this by making partnerships with robot manufacturers, so that a ready product can be purchased with everything already integrated. This is an attractive value proposition for the end-user, but technically speaking a tighter integration between vision and robot is probably not needed (it's mostly point-to-point moves, existing robot interfaces could be used).  Additionally, partnering with manufacturers provides brand, customer access, and at least the apperance of reliability. 
*** Skill providers as 3rd parties
A skill provider which provides an easily-integrated module compatible with several hardware platforms. This approach would need easy integration, but is even today possible with methods like the UR Caps or UR+ program. 
*** Data/Simulation providers
If data is key enabler, it'll probably serve as a moat for established players - curated and protected. But could someone lower barriers to entry by offering a well-curated dataset? In other machine learning areas, dataset curation is done as a kind of community service, but robot data is both more expensive and harder to find in the wild. For believers in simulation, there are services in constructing synthetic datasets with good diversity for pre-training vision systems, such as the NVIDIA Isaac platform.
*** Dataviz and Dashboard providers
These general robots will (very very very likely) need large amounts of data to train, adapt, and operate. Providing the 'picks and shovels' tools that allow this data to be collected, managed, and visualized, is critical. Companies like Foxglove provide infrastructure and interfaces which support these processes.

* Case studies on new technologies
Today, no one is close to offering direct-to-end-user robotic products for manipulation. However, some companies are offering more complex planning products, with a variety of business models.

** Online collision avoidance
The ability to re-plan the robot motion online, to avoid collision with a human/other robot, or adapt to a change in the goal poisition, enables many open-cell and multi-robot applications.  Companies like Realtime Robotics have products which enable this.  This requires the ability to stream motion commands to the robot (not just send a goal position), thus it benefits with a lower-level integration in the robot controller.  Realtime Robotics has formed a partnership with Yaskawa, enabling this.

** Picking novel objects
Improved image processing allows camera-based picking of objects, including the picking of novel objects.  Though typically with a lower accuracy, this technology is well-suited to applications with low accuracy requirements and high variance, such as good sorting or bin-picking in warehouses. Here, Covariant AI provides the vision system, and has formed partnerships with industrial players (Knapp, ABB) to provide integrated solutions in pilot cases. As these tasks are often point-to-point motions, the low-level motion streaming is not required, making integration with a new robot easier. 

** Teaching by demonstration for variation in workpiece position
For fine assembly operations such as inserting a plug, it often desired that the workpiece position can vary in position, so it can be free-standing on a conveyor or table, rather than in a fixture. A camera can correct for relative translations of a workpiece, but this requires application-specific sensing of features or object pose. A huge swath of technologies can address this, but require some local data or at least CAD. This may require a lower-level integration with the robot, such as motion streaming for more complex trajectories. However, some providers such as Micropsi industries, realize this through standard interfaces with a limited selection of robots, and can sell their system as an independent hardware module.

