robot_business_models.html

<div id="outline-container-orgeb8e8d6" class="outline-3">
<h3 id="orgeb8e8d6"><span class="section-number-3">4.4.</span> Variation in assembly operation</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Similarly, some assembly operations (insertion of a plug, screwing) have very similar motion profiles, success metrics, or visual features, but have variation in form or material which typically requires application-specific tuning. New data-based approaches seek to develop camera- or force-based skills which are capable of generalizing to new applications based on a few trial runs. If successful, would truly enable the distributor model for more complex tasks. Companies like Intrinsic are developing this, but it's still unclear how this will come on the market.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: IPK559L</p>
<p class="date">Created: 2024-05-01 Wed 05:00</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
